examples/dot/multiplexed_readout.dot
strict digraph "" {
    node [label="\N"];
    "NumericExpression1" [label="200", shape=box];
    "Port1" [label="Port", shape=box];
    "Port1" -> "NumericExpression1"  [label="Id", style=dashed];
    "Frequency1" [label="7 GHz", shape=box];
    "Radians2" [label="0 rad", shape=box];
    "Frequency3" [label="20 MHz", shape=box];
    "Frame1" [label="Frame", shape=box];
    "Frame1" -> "Port1"  [label="Port", style=dashed];
    "Frame1" -> "Frequency1"  [label="Frequency", style=dashed];
    "Frame1" -> "Radians2"  [label="Phase", style=dashed];
    "Frame1" -> "Frequency3"  [label="IntermediateFrequency", style=dashed];
    "Interval4" [label="750 ns", shape=box];
    "Waveform1" [label="ConstantWaveform", shape=box];
    "Waveform1" -> "Interval4"  [label="Duration", style=dashed];
    "Instruction4" [label="ModulatedPulse", shape=box];
    "Instruction4" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction4" -> "Waveform1"  [label="Envelope", style=dashed];
    "NumericExpression2" [label="0.2", shape=box];
    "Amplitude5" [label="Amplitude", shape=box];
    "Amplitude5" -> "NumericExpression2"  [label="Value", style=dashed];
    "Instruction4" -> "Amplitude5"  [label="Amplitude", style=dashed];
    "Frequency6" [label="7.1 GHz", shape=box];
    "Radians7" [label="0 rad", shape=box];
    "Frequency8" [label="120 MHz", shape=box];
    "Frame2" [label="Frame", shape=box];
    "Frame2" -> "Port1"  [label="Port", style=dashed];
    "Frame2" -> "Frequency6"  [label="Frequency", style=dashed];
    "Frame2" -> "Radians7"  [label="Phase", style=dashed];
    "Frame2" -> "Frequency8"  [label="IntermediateFrequency", style=dashed];
    "Interval9" [label="1 μs", shape=box];
    "Waveform2" [label="ConstantWaveform", shape=box];
    "Waveform2" -> "Interval9"  [label="Duration", style=dashed];
    "Instruction5" [label="ModulatedPulse", shape=box];
    "Instruction5" -> "Frame2"  [label="Frame", style=dashed];
    "Instruction5" -> "Waveform2"  [label="Envelope", style=dashed];
    "NumericExpression3" [label="0.2", shape=box];
    "Amplitude10" [label="Amplitude", shape=box];
    "Amplitude10" -> "NumericExpression3"  [label="Value", style=dashed];
    "Instruction5" -> "Amplitude10"  [label="Amplitude", style=dashed];
    "Instruction6:Alignment" [label="StartToStart", shape=box];
    "Instruction6:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction6:Relationship" -> "Instruction6:Alignment"  [label="Alignment", style=dashed];
    "Instruction6" [label="Dependency", shape=box];
    "Instruction6" -> "Instruction6:Relationship"  [label="Relationship", style=dashed];
    "Instruction6" -> "Instruction4"  [label="Lhs", style=dashed];
    "Instruction6" -> "Instruction5"  [label="Rhs", style=dashed];
    "NumericExpression4" [label="300", shape=box];
    "Port2" [label="Port", shape=box];
    "Port2" -> "NumericExpression4"  [label="Id", style=dashed];
    "Interval11" [label="1 μs", shape=box];
    "ComplexRangeExpression1" [label="AcquisitionComplexRangeResult", shape=box];
    "Instruction7" [label="AdcAcquisition", shape=box];
    "Instruction7" -> "Port2"  [label="Port", style=dashed];
    "Instruction7" -> "Interval11"  [label="Duration", style=dashed];
    "Instruction7" -> "ComplexRangeExpression1"  [label="Result", style=dashed];
    "Instruction8:Alignment" [label="StartToStart", shape=box];
    "Instruction8:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction8:Relationship" -> "Instruction8:Alignment"  [label="Alignment", style=dashed];
    "Instruction8" [label="Dependency", shape=box];
    "Instruction8" -> "Instruction8:Relationship"  [label="Relationship", style=dashed];
    "Instruction8" -> "Instruction6"  [label="Lhs", style=dashed];
    "Instruction8" -> "Instruction7"  [label="Rhs", style=dashed];
    "ComplexRangeExpression2" [label="Demodulation", shape=box];
    "ComplexRangeExpression2" -> "Frame1"  [label="Frame", style=dashed];
    "ComplexRangeExpression2" -> "ComplexRangeExpression1"  [label="Trace", style=dashed];
    "ComplexRangeExpression3:Values" [label="(0, 0), (1, 2), (3, 4)", shape=box];
    "ComplexRangeExpression3" [label="LiteralComplexRange", shape=box];
    "ComplexRangeExpression3" -> "ComplexRangeExpression3:Values"  [label="Values", style=dashed];
    "ComplexExpression1" [label="ComplexDotProduct", shape=box];
    "ComplexExpression1" -> "ComplexRangeExpression2"  [label="Lhs", style=dashed];
    "ComplexExpression1" -> "ComplexRangeExpression3"  [label="Rhs", style=dashed];
    "ComplexRangeRegister1" [label="ComplexRangeRegister", shape=box];
    "Instruction10" [label="ComplexAppend", shape=box];
    "Instruction10" -> "ComplexExpression1"  [label="Input", style=dashed];
    "Instruction10" -> "ComplexRangeRegister1"  [label="Output", style=dashed];
    "ComplexRangeExpression4" [label="Demodulation", shape=box];
    "ComplexRangeExpression4" -> "Frame2"  [label="Frame", style=dashed];
    "ComplexRangeExpression4" -> "ComplexRangeExpression1"  [label="Trace", style=dashed];
    "ComplexRangeExpression5:Values" [label="(0, 0), (1, 2), (3, 4)", shape=box];
    "ComplexRangeExpression5" [label="LiteralComplexRange", shape=box];
    "ComplexRangeExpression5" -> "ComplexRangeExpression5:Values"  [label="Values", style=dashed];
    "ComplexExpression2" [label="ComplexDotProduct", shape=box];
    "ComplexExpression2" -> "ComplexRangeExpression4"  [label="Lhs", style=dashed];
    "ComplexExpression2" -> "ComplexRangeExpression5"  [label="Rhs", style=dashed];
    "ComplexRangeRegister2" [label="ComplexRangeRegister", shape=box];
    "Instruction11" [label="ComplexAppend", shape=box];
    "Instruction11" -> "ComplexExpression2"  [label="Input", style=dashed];
    "Instruction11" -> "ComplexRangeRegister2"  [label="Output", style=dashed];
    "Instruction12:Alignment" [label="StartToStart", shape=box];
    "Instruction12:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction12:Relationship" -> "Instruction12:Alignment"  [label="Alignment", style=dashed];
    "Instruction12" [label="Dependency", shape=box];
    "Instruction12" -> "Instruction12:Relationship"  [label="Relationship", style=dashed];
    "Instruction12" -> "Instruction10"  [label="Lhs", style=dashed];
    "Instruction12" -> "Instruction11"  [label="Rhs", style=dashed];
    "Instruction13:Alignment" [label="EndToStart", shape=box];
    "Instruction13:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction13:Relationship" -> "Instruction13:Alignment"  [label="Alignment", style=dashed];
    "Instruction13" [label="Dependency", shape=box];
    "Instruction13" -> "Instruction13:Relationship"  [label="Relationship", style=dashed];
    "Instruction13" -> "Instruction8"  [label="Lhs", style=dashed];
    "Instruction13" -> "Instruction12"  [label="Rhs", style=dashed];
    "Job:ComplexRangeOutputs" [label="ComplexRangeOutputs", shape=box];
    "Job:ComplexRangeOutputs" -> "ComplexRangeRegister1"  [label="0", style=dashed];
    "Job:ComplexRangeOutputs" -> "ComplexRangeRegister2"  [label="1", style=dashed];
    "Job" [label="Job", shape=box];
    "Job" -> "Instruction13"  [label="EntryPoint1", style=dashed];
    "Job" -> "Job:ComplexRangeOutputs"  [label="ComplexRangeOutputs", style=dashed];
}
